//20个位置坐标xy,面向装置2个电机在远处，左上角为原点，向右x+，向下y+
#include "stm32f10x.h"
#include "Delay.h"
#include "position.h"

int pxy[20][2];
int pxy[20][2] = {
	{0,0}, //*0号坐标
	{121,97},//*1号坐标
	{151,97},//*2号坐标
	{182,97},//*3号坐标
	{121,128},//*4号坐标
	{151,128},//*5号坐标
	{182,128,},//*6号坐标
	{122,158},//*7号坐标
	{152,158},//*8号坐标
	{183,158},//*9号坐标
	{79,80},//*10号坐标
	{79,103},//*11号坐标
	{79,127},//*12号坐标
	{80,150},//*13号坐标
	{80,173},//*14号坐标
	{225,81},//*15号坐标
	{225,104},//*16号坐标
	{225,128},//*17号坐标
	{226,151},//*18号坐标
	{226,175}//*19号坐标
};
